1s/ERP/Conf/Documents/Лико_ИзменениеПараметровПроизводства.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>Лико_ИзменениеПараметровПроизводства</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ЗаказКлиента</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказКлиента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПроката</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РабочийЦентр</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РабочиеЦентры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидСекции</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Лико_ВидыСекций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Материал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкоростьПечати</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаУтверждения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Лико_СостоянияДокументаИзменениеПараметровПроизводства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

1s/ERP/Conf/Enums/Лико_СостоянияДокументаИзменениеПараметровПроизводства.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>Лико_СостоянияДокументаИзменениеПараметровПроизводства</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Подтверждено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отклонено</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

1s/ERP/Conf/Documents/Лико_ИзменениеПараметровПроизводства/Forms/ФормаСписка/Ext/Form/Module.bsl
&НаКлиенте
Процедура ПодтвердитьОтклонитьИзменение(Команда)
	
	Если Элементы.Список.ВыделенныеСтроки.Количество() > 0 Тогда
		МассивДокументов = ОбщегоНазначенияКлиентСервер.СкопироватьМассив(Элементы.Список.ВыделенныеСтроки);
		ПодтвердитьОтклонитьНаСервере(МассивДокументов, Команда.Имя);	
	КонецЕсли;
	Элементы.Список.Обновить();
	
КонецПроцедуры

&НаСервере
Процедура ПодтвердитьОтклонитьНаСервере(МассивДокументов, ИмяКоманды)

	Если ИмяКоманды = "ПодтвердитьИзменение" Тогда
		НовоеСостояние = Перечисления.Лико_СостоянияДокументаИзменениеПараметровПроизводства.Подтверждено;
	ИначеЕсли ИмяКоманды = "ОтклонитьИзменение" Тогда
		НовоеСостояние = Перечисления.Лико_СостоянияДокументаИзменениеПараметровПроизводства.Отклонено;
	Иначе
		Сообщить("Ошибка. Обратитесь к программистам");
		Возврат;
	КонецЕсли; 
	
	Для каждого ТекДокумент из МассивДокументов Цикл
		Если НЕ ЗначениеЗаполнено(ТекДокумент) Тогда
			Продолжить;
		КонецЕсли;
		Если ТекДокумент.ПометкаУдаления Тогда
			Сообщить("" + ТекДокумент + " помечен на удаление");
			Продолжить;
		КонецЕсли; 
		Если НЕ ТекДокумент.Проведен Тогда
			Сообщить("" + ТекДокумент + " сначала нужно провести");
			Продолжить;
		КонецЕсли; 
		Если ТекДокумент.Состояние = НовоеСостояние Тогда
			Сообщить("" + ТекДокумент + " уже " + ?(ИмяКоманды = "ПодтвердитьИзменение", "подтвержден", "отклонен"));
			Продолжить;
		КонецЕсли;
		
		ДокОбъект = ТекДокумент.ПолучитьОбъект();
		ДокОбъект.Состояние = НовоеСостояние;
		ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
		Лико_Дополнительно.ЗапуститьПерепроведениеЗаказаВФоне(ТекДокумент.ЗаказКлиента);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПечатьВБЗ(Команда)

	Если Элементы.Список.ТекущиеДанные <> Неопределено И ЗначениеЗаполнено(Элементы.Список.ТекущиеДанные.ЗаказКлиента) Тогда		
		ПараметрыОткрытия = Лико_Дополнительно.ПолучитьПараметрыОткрытияПечатнойФормы(,, "ВнутреннийБланкЗаказаЕРП", Элементы.Список.ТекущиеДанные.ЗаказКлиента);
		Если ПараметрыОткрытия = Неопределено Тогда
			Возврат;
		КонецЕсли;
		ОткрытьФорму("ОбщаяФорма.ПечатьДокументов", ПараметрыОткрытия, ЭтаФорма, Строка(Новый УникальныйИдентификатор));
	КонецЕсли;
	
КонецПроцедуры
